Autodesk.Revit.DB.DocumentPreviewSettings.IsViewIdValidForPreview(Autodesk.Revit.DB.ElementId)
Identifies if the view id is valid as a preview view id.
Remarks:
Only graphical views (3d or 2d) are valid for use as a preview view.  Other
views (such as view templates) will not pass this method.  InvalidElementId
is accepted by this method as this id means that no special view is set for the
preview.
viewId:
The view id.
Returns:
True if the view id is valid for preview, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.DocumentPreviewSettings.ForceViewUpdate(System.Boolean)
Sets Revit to update the preview view if necessary.
Remarks:
An update is necessary if the view has never been displayed, or if
the model has been changed and the view has not been updated or accessed.
If the preview view has not been updated, the preview may not be properly
saved.
This setting applies only to a single Save operation and is reset to
false after it is accessed.
forceViewUpdate:
True to force update of the preview view.  False to skip update if necessary (the default).
Since:
2012

Autodesk.Revit.DB.DocumentPreviewSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DocumentPreviewSettings.PreviewViewId
The view id that will be used to generate the preview.
Remarks:
This view will always be saved as the preview view for the document unless it is overridden
by the value used in SaveOptions or SaveAsOptions.
InvalidElementId signals that there is no permanent preview view for the document.
Where possible the document's active view will be used to generate the preview upon save;
where there is no active view the document will not include a preview.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The view id is not valid to use as a preview view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.DocumentPreviewSettings.IsViewUpdateForced
Identifies if Revit will update the preview view if necessary.
Remarks:
This setting applies only to a single Save operation and is reset to
false after it is accessed.
Since:
2012

Autodesk.Revit.DB.DocumentPreviewSettings
Contains the settings related to the saving of preview images for a given document.
Since:
2012